---
kind: property
id: P:Autodesk.Revit.DB.DimensionType.Prefix
source: html/8bc987fd-a5f3-9c11-e9be-860947445f81.htm
---
# Autodesk.Revit.DB.DimensionType.Prefix Property

The prefix text for the dimension value.

## Syntax (C#)
```csharp
public string Prefix { get; set; }
```

## Remarks
The text goes immediately before the value and is not overridden by the possible instance prefix.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null